{
  "backend/main.mo": "Main Motoko actor implementing the Student Bank backend with CRUD operations for students, accounts, transactions, and bank details, protected by role-based access control (admin/user) via MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report listing two features: fixing the broken admin role check for bank detail mutations, and updating the footer text to '2026 Student Bank · vaibhavgavali', with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of key frontend source files, describing the purpose of App.tsx, DashboardLayout, PassbookPage, BankDetailsPage, BankFormModal, and useQueries.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for the design system's color tokens in both light and dark modes, plus base body and border styles.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that handles Internet Identity authentication, fetches the caller's role from the backend actor, and renders either a login screen or the DashboardLayout for authenticated users.",
  "frontend/src/components/AccountFormModal.tsx": "Modal form component for creating and editing student bank accounts, with dropdowns for student and bank selection that auto-populate class and IFSC code fields.",
  "frontend/src/components/BankFormModal.tsx": "Modal dialog for adding or editing bank detail records with fields for name, taluka, district, and IFSC code, surfacing backend errors via toast notifications.",
  "frontend/src/components/DashboardLayout.tsx": "Main dashboard layout component that renders a responsive sidebar navigation and conditionally displays pages based on the user's role (admin/user/guest).",
  "frontend/src/components/StudentFormModal.tsx": "Modal form component for creating or editing a student record, using add/update mutation hooks and validating all required fields before submission.",
  "frontend/src/context/AuthContext.tsx": "React context that manages authentication state (role, accountNumber) with persistence to localStorage, exposing loginAsAdmin, loginAsUser, and logout actions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, login/logout flow, and expose the current identity and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for CRUD operations on students, accounts, transactions, bank details, and user profiles by wrapping the backend actor calls.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins and Inter fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes including a student bank color palette, gradients, and shadow utilities.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/AccountPage.tsx": "Page component for managing bank accounts with search, create, edit, and delete functionality, displaying accounts in a table with associated student and bank names.",
  "frontend/src/pages/BankDetailsPage.tsx": "Page component for viewing and managing bank details (name, taluka, district, IFSC), with admin-only add/edit/delete controls and confirmation dialogs.",
  "frontend/src/pages/HistoryPage.tsx": "Page component for searching transaction history by account number and date range, with print and CSV export capabilities.",
  "frontend/src/pages/HomePage.tsx": "Dashboard page that displays summary stat cards for total students, accounts, deposits, withdrawals, and current balance, plus a recent activity section.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login page with admin and user modes, validating admin credentials against hardcoded values and user credentials against existing accounts fetched from the backend.",
  "frontend/src/pages/PassbookPage.tsx": "Displays a searchable passbook/account statement for a given account number, showing sorted transactions and supporting print functionality, with role-based access detection.",
  "frontend/src/pages/StudentPage.tsx": "Provides a searchable, filterable list of students with add, edit, and delete operations, using a modal form and confirmation dialog.",
  "frontend/src/pages/TransactionPage.tsx": "Handles recording deposits and withdrawals for accounts, calculates live balance previews, validates sufficient funds, and displays the 20 most recent transactions.",
  "frontend/src/utils/exportCSV.ts": "Provides utility functions for exporting data to CSV files and for converting between nanosecond timestamps, date strings, and formatted currency/date display values.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters from both standard and hash-based routing, persisting them in sessionStorage, and cleaning sensitive parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, Poppins), OKLCH-based color tokens (primary, secondary, bank colors, sidebar, chart), border radii, box shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Project state descriptor (version 7) for the Student Bank mobile app, documenting existing features, architectural notes (role-based access, localStorage + canister sync, Google Sheets integration), and a known issue where the admin role check is broken on the Bank Details page."
}